In [1]:
from pathlib import Path
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import datetime
import math

In [2]:
padis = pd.read_csv("../../Data/Origineel/1512-pd.csv", sep=";")
print(padis.head())
padis.tail()

       Date/time (UTC)  Location in meters (m)  Charge (picocoulomb)
0  2016-08-03 09:00:00                     NaN                   NaN
1  2016-08-03 09:01:00                     NaN                   NaN
2  2016-08-03 09:02:00                     NaN                   NaN
3  2016-08-03 09:04:00                     NaN                   NaN
4  2016-08-03 09:05:00                     NaN                   NaN

            Date/time (UTC)  Location in meters (m)  Charge (picocoulomb)
249076  2017-01-26 09:35:00             1314.813718                8463.0
249077  2017-01-26 09:36:00                     NaN                   NaN
249078  2017-01-26 09:37:00             1302.964721               12177.5
249079  2017-01-26 09:38:00             1304.445845                9327.5
249080  2017-01-26 09:39:00                     NaN                   NaN

In [3]:
date, location, charge = padis.columns
padis.columns = "date", "location", "charge"
print(padis.head())
print(padis.columns)

                  date  location  charge
0  2016-08-03 09:00:00       NaN     NaN
1  2016-08-03 09:01:00       NaN     NaN
2  2016-08-03 09:02:00       NaN     NaN
3  2016-08-03 09:04:00       NaN     NaN
4  2016-08-03 09:05:00       NaN     NaN
Index(['date', 'location', 'charge'], dtype='object')

In [4]:
list = ["hoi","Babaan","Brooeneiaowfj"]
a, b, c = list
print(a)
list = "abc", "bbaba"
print(list[0])
print(list[1])

hoi
abc
bbaba

In [5]:
padis.index

RangeIndex(start=0, stop=249081, step=1)

In [6]:
padis.columns

Index(['date', 'location', 'charge'], dtype='object')

In [7]:
date, location, charge = padis.columns

In [8]:
padis.describe()

           location         charge
count  22140.000000   22140.000000
mean    1035.160729   20993.877778
std      282.545464   23116.202767
min        0.000000     156.500000
25%      818.202575    5849.000000
50%      862.642903    8987.750000
75%     1308.867572   30669.500000
max     1382.750000  479117.500000

In [9]:
padis[5:12]

                   date     location  charge
5   2016-08-03 09:06:00          NaN     NaN
6   2016-08-03 09:07:00          NaN     NaN
7   2016-08-03 09:08:00          NaN     NaN
8   2016-08-03 09:09:00          NaN     NaN
9   2016-08-03 09:10:00          NaN     NaN
10  2016-08-03 09:11:00  1308.770571  1891.5
11  2016-08-03 09:12:00          NaN     NaN

In [10]:
padis.loc[:, [date,location]].head()

                  date  location
0  2016-08-03 09:00:00       NaN
1  2016-08-03 09:01:00       NaN
2  2016-08-03 09:02:00       NaN
3  2016-08-03 09:04:00       NaN
4  2016-08-03 09:05:00       NaN

In [11]:
print(padis[0:15])
padis.loc[0:15,[date,charge]]

                   date     location  charge
0   2016-08-03 09:00:00          NaN     NaN
1   2016-08-03 09:01:00          NaN     NaN
2   2016-08-03 09:02:00          NaN     NaN
3   2016-08-03 09:04:00          NaN     NaN
4   2016-08-03 09:05:00          NaN     NaN
5   2016-08-03 09:06:00          NaN     NaN
6   2016-08-03 09:07:00          NaN     NaN
7   2016-08-03 09:08:00          NaN     NaN
8   2016-08-03 09:09:00          NaN     NaN
9   2016-08-03 09:10:00          NaN     NaN
10  2016-08-03 09:11:00  1308.770571  1891.5
11  2016-08-03 09:12:00          NaN     NaN
12  2016-08-03 09:13:00          NaN     NaN
13  2016-08-03 09:14:00          NaN     NaN
14  2016-08-03 09:15:00          NaN     NaN

                   date  charge
0   2016-08-03 09:00:00     NaN
1   2016-08-03 09:01:00     NaN
2   2016-08-03 09:02:00     NaN
3   2016-08-03 09:04:00     NaN
4   2016-08-03 09:05:00     NaN
5   2016-08-03 09:06:00     NaN
6   2016-08-03 09:07:00     NaN
7   2016-08-03 09:08:00     NaN
8   2016-08-03 09:09:00     NaN
9   2016-08-03 09:10:00     NaN
10  2016-08-03 09:11:00  1891.5
11  2016-08-03 09:12:00     NaN
12  2016-08-03 09:13:00     NaN
13  2016-08-03 09:14:00     NaN
14  2016-08-03 09:15:00     NaN
15  2016-08-03 09:17:00     NaN

In [12]:
print(padis.loc[0,date])
print("hallo jumbo")
print(padis.loc[5])
print(padis.loc[-2:-1,date])

print(padis.index[-1])

print(padis.loc[padis.index[-1],date])

2016-08-03 09:00:00
hallo jumbo
date        2016-08-03 09:06:00
location                    NaN
charge                      NaN
Name: 5, dtype: object
Series([], Name: date, dtype: object)
249080
2017-01-26 09:39:00

In [13]:
df0 = pd.DataFrame(np.random.randn(6,4))
df0

          0         1         2         3
0 -0.429000  0.259254  0.678075 -0.025272
1 -2.278943  1.285225  0.761406 -0.786814
2 -0.305612 -1.036723 -0.514278 -1.128647
3  1.025593 -1.362733  0.366868 -0.480794
4  0.123119 -0.711286  1.959752  0.277684
5 -0.971556 -1.319791 -0.743432  0.773016

In [14]:
dates = pd.date_range('20130101', periods=5)
df = pd.DataFrame( np.random.randn(5, 7), index=['2','4','7','8','9'], columns = ['Z','X','C','V','B','N','M',])
#df = pd.DataFrame( np.random.randn(5, 7), index=['2','4','7','8','9'], columns=list('HABTEUV'))
print(df)
#columns = list('HABTEUV')

          Z         X         C         V         B         N         M
2 -0.433673  0.433200 -0.137088  1.025060 -0.161480 -2.430209 -0.037756
4 -0.773941  1.061425  0.325176 -0.100679 -0.880127  0.499276 -1.183845
7 -0.119189  0.221318 -0.958317 -0.175551 -0.211597  0.170989  0.428906
8  0.258156  0.050511  0.600227  1.044214 -0.435200 -1.500924 -0.100962
9  1.249579 -0.977002 -1.507665 -0.636998 -1.001980  0.188108 -0.682725

In [15]:
print(df.loc['4','Z'])
print(df.loc['2':'7','Z':'C'])
print(df.loc['2':'7',['Z','C']])
print(df.loc[['2','7'],['Z','C']])

print(df.loc["4"])
print(df['Z'])

print(df.loc[['2','7'],['M','Z','C']])

-0.7739412080986334
          Z         X         C
2 -0.433673  0.433200 -0.137088
4 -0.773941  1.061425  0.325176
7 -0.119189  0.221318 -0.958317
          Z         C
2 -0.433673 -0.137088
4 -0.773941  0.325176
7 -0.119189 -0.958317
          Z         C
2 -0.433673 -0.137088
7 -0.119189 -0.958317
Z   -0.773941
X    1.061425
C    0.325176
V   -0.100679
B   -0.880127
N    0.499276
M   -1.183845
Name: 4, dtype: float64
2   -0.433673
4   -0.773941
7   -0.119189
8    0.258156
9    1.249579
Name: Z, dtype: float64
          M         Z         C
2 -0.037756 -0.433673 -0.137088
7  0.428906 -0.119189 -0.958317

In [16]:
print(df.iloc[4])
print(df.iloc[4,[3,5,1]])

Z    1.249579
X   -0.977002
C   -1.507665
V   -0.636998
B   -1.001980
N    0.188108
M   -0.682725
Name: 9, dtype: float64
V   -0.636998
N    0.188108
X   -0.977002
Name: 9, dtype: float64

In [17]:
pdsocc = padis.dropna(subset=[charge])
print(pdsocc[location])
charges = pdsocc[charge]
print(charges)
charges.mean()

10        1308.770571
236       1316.173112
357       1301.368029
567       1314.692604
600        816.713966
601        819.674982
602        815.233458
603        818.194474
604        815.233458
605        815.233458
606        813.030000
607        816.713966
608        816.713966
609        813.030000
610        819.674982
611        802.695122
612        818.194474
613        821.155491
614        813.030000
615        813.030000
616        827.077524
617        630.650542
618        824.116507
619        864.090231
627       1313.212095
745        841.882607
1065      1310.251079
1105       584.754785
1106       816.713966
1107       821.155491
             ...
249015    1300.002471
249018    1295.559097
249019    1302.964721
249027    1304.445845
249028    1300.002471
249029    1298.521347
249034    1302.964721
249039    1314.813718
249041    1311.851468
249045    1310.370344
249048    1308.889219
249049    1307.408094
249050    1311.851468
249051    1305.926970
249052    1304.445845
249053    1307.408094
249054    1300.002471
249056    1302.964721
249057    1307.408094
249058    1304.445845
249064    1300.002471
249065    1305.926970
249066    1311.851468
249069    1310.370344
249070    1313.332593
249072    1311.851468
249073    1304.445845
249076    1314.813718
249078    1302.964721
249079    1304.445845
Name: location, Length: 22140, dtype: float64
10         1891.5
236        5511.0
357        2477.5
567        4941.0
600       34371.5
601       68391.0
602       10971.5
603       18801.5
604       25763.5
605       39124.5
606        5126.0
607       23625.5
608       29430.5
609       36346.5
610       35444.0
611       25169.5
612       25253.0
613       56022.5
614       26938.5
615       30574.5
616       20490.5
617        2803.5
618        7331.5
619        2606.5
627        3013.5
745       10481.0
1065       2372.0
1105      96845.0
1106      49558.5
1107      10934.5
           ...
249015     4531.0
249018    18949.0
249019     7392.5
249027    11573.5
249028    13978.5
249029    10851.0
249034     7076.0
249039     7331.0
249041     7198.5
249045     8269.5
249048     6254.0
249049     6344.5
249050     8116.0
249051     8948.5
249052     9250.0
249053    10965.5
249054    15710.5
249056     8052.0
249057     7578.0
249058     8486.0
249064    10537.5
249065     7733.0
249066     4202.0
249069     6070.5
249070     4924.0
249072     5041.0
249073    10832.0
249076     8463.0
249078    12177.5
249079     9327.5
Name: charge, Length: 22140, dtype: float64

20993.87777777778

In [18]:
padis[charge].mean()

20993.87777777778

In [19]:
padis[padis.charge>5000][charge].mean()

24287.164593430265

In [20]:
padis.iloc[np.random.randint(padis.index[-1], size=10)]

                       date     location   charge
169914  2016-12-02 18:18:00          NaN      NaN
201892  2016-12-24 22:52:00          NaN      NaN
228174  2017-01-12 08:35:00  1305.926970   7637.5
115008  2016-10-24 06:25:00   818.219183  36575.0
88547   2016-10-05 02:46:00          NaN      NaN
194982  2016-12-20 01:33:00          NaN      NaN
199058  2016-12-22 19:50:00          NaN      NaN
230861  2017-01-14 03:40:00          NaN      NaN
65512   2016-09-18 12:31:00          NaN      NaN
113703  2016-10-23 08:19:00          NaN      NaN

Totale lading van alle PDs in september tussen 100m en 200m

In [21]:
sum(padis[(padis.location>100) & (padis.location<200) & padis.date.str.contains("-09-")][charge])

17072.0

In [47]:
pdsocclocs = pdsocc[location]
pdsocclocs.sort_values()
np.diff(pdsocclocs.sort_values()).mean()

0.06245765391390758

In [60]:
pdsocc[date].iloc[0].apply(datetime.datetime.fromisoformat)

AttributeError: 'str' object has no attribute 'apply'